In [1]:
import pyodbc
import pandas as pd
import numpy as np
from datetime import datetime
from sklearn.preprocessing import LabelEncoder

In [32]:
cnxn_str = ("Driver={SQL Server Native Client 11.0};"
            "Server=LAPTOP-CTTVUGH7;"
            "Database=tables_fait;"
            "Trusted_Connection=yes;")

cnxn = pyodbc.connect(cnxn_str)
cursor = cnxn.cursor()

In [33]:
import sqlalchemy
engine = sqlalchemy.create_engine("mssql+pyodbc://LAPTOP-CTTVUGH7/tables_fait?driver=SQL Server?Trusted_Connection=yes")
conn = engine.connect()

In [18]:
fait_BM = pd.read_sql("SELECT * FROM [fait_BM]", cnxn)

In [34]:
#user has less than 3 cars but they are under flotte
query = "SELECT count(CodeVehicule_id) as count,CodeAssure_id FROM fait_BM where typePolice='F' group by CodeAssure_id having count(CodeVehicule_id) <4 "
results = cursor.execute(query).fetchall()

In [36]:
dataframe = pd.read_sql(query, con = conn)
dataframe

      count  CodeAssure_id
0         1          85754
1         1         773824
2         1        1072590
3         1        1063791
4         3        1072490
...     ...            ...
1917      1        1065719
1918      1        1072503
1919      2        1065668
1920      1          99052
1921      1         276155

[1922 rows x 2 columns]

In [37]:
#vehicule usage is private but its under flotte
query = "SELECT CodeVehicule_id FROM fait_BM where codeUsage=1 and typePolice='F' "
results = cursor.execute(query).fetchall()

In [ ]:
dataframe = pd.read_sql(query, con = conn)
dataframe

In [ ]:
#vehicule usage is "rental" or "travel agency" but its under individual
query = "SELECT CodeVehicule_id FROM fait_BM where codeUsage in (15,14) and typePolice='I' "
results = cursor.execute(query).fetchall()

In [ ]:
dataframe = pd.read_sql(query, con = conn)
dataframe

In [ ]:
#user has more than 4 cars but type individual
query = "SELECT count (CodeVehicule_id) as count_CodeVehicule_id,CodeAssure_id FROM fait_BM where typePolice='I' group by CodeAssure_id having (count (CodeVehicule_id)) >=4 "
results = cursor.execute(query).fetchall()

In [ ]:
dataframe = pd.read_sql(query, con = conn)
dataframe

In [ ]:
#client frequently changes companies for one car
query = "SELECT CodeVehicule_id ,count (codeCompagnie) as count_codeCompagnie FROM fait_BM where typePolice='I' group by CodeVehicule_id having (count (codeCompagnie)) >3 "
results = cursor.execute(query).fetchall()

In [ ]:
dataframe = pd.read_sql(query, con = conn)
dataframe